; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2595)
	(= (fuel plane1) 230)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city3)
	(= (capacity plane2) 6637)
	(= (fuel plane2) 2880)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at person1 city3)
	(at person2 city2)
	(at person3 city3)
	(at person4 city0)
	(at person5 city1)
	(at person6 city0)
	(at person7 city3)
	(at person8 city3)
	(at person9 city2)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 758)
	(= (distance city0 city2) 522)
	(= (distance city0 city3) 726)
	(= (distance city1 city0) 758)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 721)
	(= (distance city1 city3) 563)
	(= (distance city2 city0) 522)
	(= (distance city2 city1) 721)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 578)
	(= (distance city3 city0) 726)
	(= (distance city3 city1) 563)
	(= (distance city3 city2) 578)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at person1 city0)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city1)
	(at person6 city2)
	(at person7 city3)
	(at person8 city0)
	(at person9 city1)
	(at person10 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 11
2. (board person3 plane2 city3)
   deleted: (at person3 city3)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 5 of 11
3. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 5 of 11
4. (fly plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 0 to 2178, (fuel plane2) from 2880 to 702
   goals met: 4 of 11
5. (refuel plane2 city0)
   changed: (fuel plane2) from 702 to 6637
   goals met: 4 of 11
6. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 11
7. (debark person8 plane2 city0)
   deleted: (in person8 plane2)
   added: (at person8 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 11
8. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 11
9. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 2178 to 4452, (fuel plane2) from 6637 to 4363
   goals met: 6 of 11
10. (debark person3 plane2 city1)
   deleted: (in person3 plane2)
   added: (at person3 city1)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 11
11. (fly plane2 city1 city2)
   deleted: (at plane2 city1)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 4452 to 6615, (fuel plane2) from 4363 to 2200
   goals met: 7 of 11
12. (debark person6 plane2 city2)
   deleted: (in person6 plane2)
   added: (at person6 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 11
13. (board person2 plane2 city2)
   deleted: (at person2 city2)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 8 of 11
14. (board person9 plane2 city2)
   deleted: (at person9 city2)
   added: (in person9 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 8 of 11
15. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 6615 to 8349, (fuel plane2) from 2200 to 466
   goals met: 9 of 11
16. (refuel plane2 city3)
   changed: (fuel plane2) from 466 to 6637
   goals met: 9 of 11
17. (fly plane2 city3 city0)
   deleted: (at plane2 city3)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 8349 to 10527, (fuel plane2) from 6637 to 4459
   goals met: 8 of 11
18. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 9 of 11
19. (fly plane2 city0 city1)
   deleted: (at plane2 city0)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 10527 to 12801, (fuel plane2) from 4459 to 2185
   goals met: 9 of 11
20. (debark person9 plane2 city1)
   deleted: (in person9 plane2)
   added: (at person9 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 11
21. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 12801 to 14490, (fuel plane2) from 2185 to 496
   goals met: 11 of 11
